In [1]:
import pandas as pd

In [67]:
z = "opp_turnovers"
df = pd.read_csv("data/a/" + z + ".csv")

In [68]:
df.head(1)

,Unnamed: 0,date,rank,team,current_year_total,last_three,last_game,home_score_avg,away_score_avg
0,0,2015-11-03,1,Boston,22.0,22.0,20.0,22.0,--

In [69]:
df = df.sort_values(by=["team", "date"])

In [70]:
df.head()

,Unnamed: 0,date,rank,team,current_year_total,last_three,last_game,home_score_avg,away_score_avg
8,8,2015-11-03,9,Atlanta,17.0,17.7,12.0,17.5,16.5
33,33,2015-11-04,4,Atlanta,17.4,17.0,19.0,17.5,17.3
64,64,2015-11-05,5,Atlanta,17.7,16.7,19.0,18.0,17.3
93,93,2015-11-06,4,Atlanta,17.7,16.7,19.0,18.0,17.3
125,125,2015-11-07,6,Atlanta,17.0,17.0,13.0,18.0,16.2

In [71]:
del df["Unnamed: 0"], df["team"]

In [72]:
df = df.rename(columns = {"rank": "rank_"+z, 'current_year_total': 'current_year_' + z, 'last_three' : 'last_three_' + z, "last_game": "last_game_"+z, "home_score_avg": "home_"+z+"_avg", "away_score_avg": "away_"+z+"_avg"}, inplace = False)

In [73]:
df.head(1)

,date,rank_opp_turnovers,current_year_opp_turnovers,last_three_opp_turnovers,last_game_opp_turnovers,home_opp_turnovers_avg,away_opp_turnovers_avg
8,2015-11-03,9,17.0,17.7,12.0,17.5,16.5

In [74]:
df.to_csv("order_data/"+z+".csv")